---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.StructuralColumnAttachedToNonStructuralTarget
source: html/8b494ee4-8af9-187e-ffae-1604319b8299.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.StructuralColumnAttachedToNonStructuralTarget Property

The structural column is attached to a non-structural target.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralColumnAttachedToNonStructuralTarget { get; }
```